background_zone/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs            ("liboverset.so");

application     overPimpleDyMFoam;

startFrom       latestTime;


stopAt          endTime;

endTime         4;

deltaT          1e-3;


writeControl    adjustableRunTime;
writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  true;

maxCo 		14;

functions
{

forces
    {
        type          forces;
        libs          ("libforces.so");

        patches       ("seed"); // Specify the patches where forces are calculated
        rho           rhoInf;     // Use `none` to indicate incompressible, or you can omit it
        rhoInf        1.225;    // Set your desired constant density here (e.g., for air)
        log           yes;
        
        origin        (0 0 0);
        rotation
        {
            type      axes;
            e3        (0 0 1);
            e1        (1 0 0);
        }
    }



fileUpdate1
{
    type              timeActivatedFileUpdate;
    libs              ("libutilityFunctionObjects.so");
    writeControl      timeStep;
    writeInterval     1;
    fileToUpdate      "<system>/maxCo";
    timeVsFile
    (
        (-1   "<system>/maxCo0.01")
        (0.01 "<system>/maxCo0.02")
        (0.04 "<system>/maxCo0.03")
        (0.06 "<system>/maxCo0.04")
        (0.07 "<system>/maxCo0.05")
        (0.09 "<system>/maxCo0.06")
        (0.1 "<system>/maxCo0.07")
        (0.2 "<system>/maxCo0.08")
        (0.3 "<system>/maxCo0.09")
        (0.4 "<system>/maxCo0.10")
    );
}

    
}


// ************************************************************************* //
