background_zone/system/blockMeshDict1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
 // large domain
    (-0.85 -0.85 -9.3)
    (0.85 -0.85 -9.3)
    (0.85  0.85 -9.3)
    (-0.85  0.85 -9.3)
    (-0.85 -0.85 0.65)
    (0.85 -0.85 0.65)
    (0.85 0.85 0.65)
    (-0.85  0.85 0.65)

);

blocks
(
    // small domain block
    hex (0 1 2 3 4 5 6 7) (45 45 350) 
	simpleGrading
	(
	// x-direction expansion ratio
	(
		(0.15 0.15 1)
		(0.7 0.7 1)
		(0.15 0.15 1)

	)
	
	// y-direction expansion ratio
	(
		(0.15 0.15 1)
		(0.7 0.7 1)
		(0.15 0.15 1)
	)
	
	// z-direction expansion ratio  
	(
		(0.25 0.25 1)
		(0.25 0.25 1)
		(0.5 0.5 1)
	)
	)

);

edges
(
);

// Boundaries is where we define our boundary patches.

boundary
(
	walls
		{
		    type wall;
		    faces
		    (
		   	    (2 6 5 1)
			    (0 4 7 3)
			    (3 7 6 2)
			    (1 5 4 0)
			    (4 5 6 7)
			    (0 3 2 1)
		    );
		}

	
);

mergePatchPairs
(
);
