background_zone/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

motionSolverLibs ( "libsixDoFRigidBodyMotion.so" );

dynamicFvMesh       dynamicOversetFvMesh;

solver              sixDoFRigidBodyMotion;

diffusivity         quadratic inverseDistance 1 ( seed );

sixDoFRigidBodyMotionCoeffs
{
    patches             ( seed );
    innerDistance       1; 
    outerDistance       2;
    centreOfMass        (0 0 0);
    mass                5.5e-05;
    momentOfInertia     (1.74403669210059e-09 3.16070864100764e-10 2.027012473404723e-09);
    velocity            (0 0 0);
    //angularMomentum     (0 0 1.02701247340472e-07);
    rho                 rhoInf;
    rhoInf              1.225;
    accelerationRelaxation 0.7;
	accelerationDamping	0.9;
    report              on;
    reportToFile        on;
    g                   (0 0 -9.81); 
    solver
    {
        type            Newmark;
    }




}

// ************************************************************************* //
