background_zone/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
/*
solvers
{
    cellDisplacement
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
        maxIter         100;
    }

    p
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-11;
        relTol          0.01;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    pcorr
    {
        $p;
        solver          PCG;
        preconditioner  DIC;
    }

    pcorrFinal
    {
        $pcorr;
        relTol          0;
    }

    "(U|k|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0;
    }

    "(U|k|omega)Final"
    {
        $U;
        tolerance       1e-6;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor   true;
    oversetAdjustPhi    true;
    nOuterCorrectors    7;
    nCorrectors         4;
    nNonOrthogonalCorrectors 2;
    massFluxInterpolation true;
    ddtCorr             false;
    turbOnFinalIterOnly false;



}

relaxationFactors
{
    fields
    {
        p               0.4;
    }
    equations
    {
        "(U|k|omega)"   0.6;
        ".*Final"        1;
    }
}
*/

solvers
{
    cellDisplacement
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-07;
        relTol          0;
        maxIter         100;
    }

    p
    {
        solver          PBiCGStab; 
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
    }




    pFinal
    {
        $p;
        relTol          0;
    }

    pcorr
    {
        $pFinal;
        solver          PBiCGStab;
        preconditioner  DILU;
    }

    pcorrFinal
    {
        $pcorr;
        relTol          0;
    }

    "(U|k|epsilon|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0;
    }

    "(U|k|epsilon|omega)Final"
    {
        $U;
        tolerance       1e-6;
        relTol          0;
    }
}


PIMPLE
{
    momentumPredictor   true;
    oversetAdjustPhi    true;
    nOuterCorrectors    3;
    nCorrectors         3;
    nNonOrthogonalCorrectors 2;
    massFluxInterpolation true;
    ddtCorr             true;
    turbOnFinalIterOnly false;
    pRefCell		0;
    pRefValue		0;


}

relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        "(U|k|omega)"   0.7;
        ".*Final"        0.9;
    }
}

// ************************************************************************* //
