background_zone/system/maxCo
maxCo           0.08;
