background_zone/system/maxCo0.06
maxCo           0.06;
