background_zone/system/maxCo0.07
maxCo           0.07;
