background_zone/system/maxCo0.08
maxCo           0.08;
